<div class="black-list_block" hidden>
    <h2>Черный список адвокатов</h2>

    <p>На данной странице Вы можете разместить отзыв об адвокате в соответствие с правилами, а также проверить адвоката на предмет наличия в отношении него отрицательной информации, ранее размещённой в публичном доступе (с указанием первоисточника).</p>
    <p>Если Вы не нашли недобросовестного адвоката в чёрном списке адвокатов и можете сообщить конкретные факты нарушений адвокатом законодательства (мошеннических действий, оказания услуг ненадлежащего качества и др.), заполните форму отзыва, после чего информация будет опубликована на сайте.</p>
    <p>Согласно ч. 2 ст. 9 и ч. 1 ст. 17 Федерального закона «Об адвокатской деятельности и адвокатуре в РФ» не могут осуществлять адвокатскую деятельность лица, имеющие непогашенную или неснятую судимость за совершение умышленного преступления; вступление в законную силу приговора суда о признании адвоката виновным в совершении умышленного преступления является безусловным основанием для прекращения статуса адвоката.</p>

    <button class="btn">Оставить отзыв</button>
</div>

<div class="complain_block" hidden>
    <h2>Подача жалобы на адвоката</h2>
    <p>Адвокатская деятельность, хотя и не преследует цели извлечения прибыли, осуществляется в форме оказания услуг, а потому, как и любая иная услуга, имеет цену и характеризуется качеством. В случае, когда клиент адвоката не доволен качеством оказания предоставленных ему адвокатских услуг, либо при нарушении адвокатом законодательства Российской Федерации можно пожаловаться на адвоката.</p>
    <p>Жалобы на адвоката можно разделить на две основные группы в зависимости от того, связаны ли они с осуществлением адвокатом профессиональной (адвокатской) деятельности или нет.</p>
    <p>1.	Жалобы на адвоката в связи с осуществлением им профессиональной деятельности, если адвокат нарушил Кодекс профессиональной этики при осуществлении адвокатской деятельности. </p>
    <p>В этом случае Вы можете подать жалобу на адвоката в Адвокатскую палату при этом приложив все имеющиеся у Вас документы, подтверждающие Ваши доводы: копию соглашения, квитанции к приходному ордеру, копии процессуальных документов и др. Основания привлечения адвоката к ответственности в связи с осуществлением им профессиональной деятельности, процедура рассмотрения жалобы и порядок привлечения к ответственности адвоката регламентируются двумя основными нормативными документами: 1) Закон «Об адвокатской деятельности и адвокатуре в РФ»; 2) Кодекс профессиональной этики адвоката, принятый 31.01.2003 года на 1 Всероссийском съезде адвокатов, с последующими изменениями и дополнениями. </p>
    <p>2.	Жалобы на адвоката, не связанные с осуществлением адвокатской деятельности. Если адвокат нарушил Ваши права и интересы вне оказания Вам адвокатских услуг, то ответственность за нарушения наступает для адвоката наравне со всеми остальными гражданами. Так, если в отношении Вас совершено преступление, Вы можете обратиться с заявлением в органы полиции или Следственного комитета РФ, если правонарушение повлекло причинение Вам ущерба – Вы также можете обратиться с гражданским иском в мировой суд или суд общей юрисдикции в зависимости от того, к чьей подсудности относится дело.</p>
    <p>Иначе обстоят дела, если адвокат склоняет Вас к даче взятки должностному лицу, упоминает десятки фамилий руководителей правоохранительных органов, следователей, прокуроров, судей. Многих называет по именам, панибратски, подчеркивая неформальные, близкие с ними отношения, при этом указывает, что в городе существуют «расценки на взятки», «пирамида взяточников», где каждое звено делится частью поборов с вышестоящим руководством. Также недобросовестный адвокат всегда старается «сгущать краски», указывая максимальную санкцию статей УК РФ, давит на то, что Ваша вина будет обязательно доказана, а единственный способ уйти от ответственности — дать взятку следователю, который, «по счастью», является его хорошим знакомым. Но как показывает практика недобросовестный адвокат, принимая на себя функции посредника просто - напросто присваивает полученные для передачи материальные ценности и в конечном итоге распоряжается ими по своему усмотрению. В связи с чем, данный адвокат должен нести ответственность за мошенничество, а также за подстрекательство к даче взятки.</p>
    <p>Нередки случаи, когда адвокат указывает не достоверную информацию, что конкретное должностное лицо вымогает взятку у его подзащитного, то его действия также подлежат квалификации по совокупности с преступлением, предусмотренным ч.3 ст.298 УК РФ — клевета в отношении судьи и других перечисленных в ч.1 и 2 данной статьи должностных лиц, соединенная с обвинением в совершении тяжкого или особо тяжкого преступления. Подобные преступления наносят колоссальный вред интересам правосудия, и авторитету адвокатуры, и чести, достоинству, деловой репутации конкретных судей, прокуроров, следователей. Коэффициент латентности таких преступлений на сегодняшний день крайне высок.</p>
    <p>Не менее распространенным, является способ мошенничества, основанный на частичной передаче предмета взятки. Речь идет о случаях, когда коррумпированный адвокат, требует на взятки для судьи, следователя определенную сумму, получает ее, но передает взяткополучателю только часть, как правило, менее половины, обманывая тем самым и взяткополучателя, и взяткодателя.</p>
    <p>Действия такого адвоката подпадают под признаки совокупности преступлений:
    <br>— статей 33 (ч.4) и 291 (ч.1) УК РФ — подстрекательство к даче взятки (если подстрекательские действия имели место);
    <br>— статьи 33 (ч.5) и соответствующая часть и пункт ст.290 УК РФ соучастие в форме пособничества в получении взятки;
    <br>— статьи 33 (ч.5) и соответствующая часть ст.285 УК РФ соучастие в форме пособничества, в злоупотреблении должностными полномочиями;
    <br>— соответствующая часть и пункт ст.159 УК РФ — мошенничество.</p>
    <p>Все выше сказанное ни в коем случае не должно бросать тень на всё профессиональное адвокатское сообщество. Подавляющее большинство адвокатов – безусловно честные и порядочные люди, для которых закон и профессиональная этика является главными ориентирами в работе.</p>
    <p>Если Вы считаете, что пострадали от противоправных действий своего адвоката, а также, что на текущий период времени Ваш адвокат подстрекает Вас к даче взятки (следователю, оперуполномоченному, прокурору либо судье), то Вы можете сообщить нам об этом в электронной форме.</p>
    <p>В электронной анкете в Вашем обращении укажите в именительном падеже Ваши:</p>
    <div class="content">
        <span class="label">Фамилию *</span>
        <input name="surname" class="surname"><br>

        <span class="label">Имя  *</span>
        <input name="name" class="name"><br>

        <span class="label">Отчество (при наличии)</span>
        <input name="lastname" class="lastname"><br>

        <span class="label">Наименование организации (юридического лица)</span>
        <input name="ur_org" class="ur_org"><br>

        <p>В электронной анкете в Вашем обращении укажите:</p>

        <span class="label">адрес электронной почты, по которому должны быть направлены ответ, уведомление о переадресации Вашего обращения *</span>
        <input name="email" class="email"><br>

        <span class="label">Повторите адрес электронной почты для автоматической проверки правильности его заполнения</span>
        <input name="email2" class="email2"><br>

        <span class="label">Номер телефона</span>
        <input name="phone" class="phone"><br>

        <p>Напишите текст обращения</p>
        <span class="label">Обращаем Ваше внимание, что в целях объективного и всестороннего рассмотрения Вашего обращения в установленные сроки необходимо в тексте обращения указывать адрес описанного Вами места действия, факта или события.<br><br>В случае, если текст Вашего обращения не позволяет определить суть предложения, заявления или жалобы, ответ на обращение не дается, и оно не подлежит направлению на рассмотрение в государственный орган, орган местного самоуправления или должностному лицу, в соответствии с их компетенцией, о чем Вам будет сообщено в течение семи дней со дня регистрации обращения. <br><br>Обращаем Ваше внимание, что при написании текста обращения в форме электронного документа в поле ввода текста обращения в форме электронного документа для изложения сути предложения, заявления или жалобы отсутствует ограничение по вводимому количеству символов.<br><br>В поле ввода текста обращения в форме электронного документа в Вашем обращении: изложите суть предложения, заявления или жалобы *</span><br>

        <p>В поле ввода текста обращения в форме электронного документа в Вашем обращении:</p>
        <span class="label">изложите суть предложения, заявления или жалобы *</span>
        <textarea name="message" class="message"></textarea><br>
        <span class="label">В случае необходимости в подтверждение своих доводов гражданин вправе приложить к обращению необходимые документы и материалы в электронной форме, воспользовавшись функцией «Прикрепить файл».<br><br>Обращаем внимание, что прикрепляемые в предложенном на сайте формате документы и материалы служат лишь подтверждением доводов автора обращения, изложенных в тексте обращения.<br><br>Приложить необходимые документы и материалы в электронной форме можно в любой последовательности двумя самостоятельными вложениями файла без архивирования (файл вложения) по одному из двух разных типов допустимых форматов:<br><br>текстового (графического) формата: txt, doc, docx, rtf, xls, xlsx, pps, ppt, odt, ods, odp, pub, pdf, jpg, jpeg, bmp, png, tif, gif, pcx;</span><br>
        <input type="file" class="file"><br>
        <div class="added_files"></div>
        <span class="label">Обращаем внимание, что информация о персональных данных авторов обращений, направленных в электронном виде, не хранится и не обрабатывается, так как «Краевой Центр» не является оператором персональных данных.</span><br>
        <span class="label">* Поля, отмеченные звездочкой, обязательны для заполнения.</span><br>
        <a href="#" class="btn">Сообщить о преступлении</a>
    </div>


</div>
<div class="review_block" hidden>
    <h2>Отзывы об адвокатах</h2>
    <p>Если у вас есть опыт сотрудничества с адвокатом, будем признательны, если вы поделитесь своим мнением о работе специалиста. Ваш положительный или отрицательный отзыв может быть полезен другим людям, нуждающимся в качественной юридической помощи.</p>
    <p>Чтобы оставить отзыв про адвоката, заполните специальную форму, указав всю необходимую информацию о себе и специалисте, оказавшем вам юридические услуги. Вы можете указать характеризующую адвоката информацию как связанную с осуществлением адвокатской деятельности, так и по известным Вам обстоятельствам вне осуществления последним профессиональной деятельности.</p>
    <p>Все отзывы проходят предварительную проверку на предмет достоверности: публикуются только реальные мнения людей, основанные на их собственном опыте и в соответствие с утверждёнными правилами.</p>
    <p>Наш ресурс не раскрывает и не передает персональные данные третьим лицам. Адрес вашей электронной почты скрывается при публикации отзыва.</p>
    <button class="btn">Оставить отзыв</button>
</div>


<script>
    setTimeout(() => {
        document.querySelector('button.review').onclick = showReviewBlock;
        document.querySelector('div.review_block > button').onclick = showReviewForm;
        document.querySelector('div.black-list_block > button').onclick = showReviewForm;
        document.querySelector('button.black-list').onclick = showBlackListBlock;
        document.querySelector('button.complain').onclick = showComplainBlock;
        document.querySelector('.feedback .btn').onclick = sendFeedback;
    }, 1)


function showComplainBlock() {
    let complaintBl = document.querySelector('.complain_block');
    complaintBl.hidden = false;
    document.querySelector('.review_block').hidden = true;
    document.querySelector('.black-list_block').hidden = true;
    document.querySelector('.main').style.display = 'none';
    document.querySelector('.disclaymer').hidden = true;
}

function showBlackListBlock() {
    document.querySelector('.black-list_block').hidden = false;
    document.querySelector('.review_block').hidden = true;
    document.querySelector('.main').style.display = 'unset';
    document.querySelector('.complain_block').hidden = true;

    getAdvokatsTable2('/assets/php/db.php?get=black&loaded=advokats');
    document.querySelector('.main h2').innerText = 'Черный список адвокатов';
    document.querySelector('#search').dataset.selector = 'black';
    document.querySelector('.disclaymer').hidden = false;
}



function showReviewBlock() {
    document.querySelector('#search').dataset.selector = 'review';
    document.querySelector('.main').style.display = 'none';
    document.querySelector('.review_block').hidden = false;
    document.querySelector('.complain_block').hidden = true;
    document.querySelector('.black-list_block').hidden = true;
    document.querySelector('.disclaymer').hidden = true;
}

function showReviewForm() {
    document.querySelector('.review_cont').hidden = false;
    window.scrollTo(0,0);
}
function reviewClose() {
    document.querySelector('.review_cont').hidden = true;
}


function getAdvokatsTable2 (url) {
    let xhr = new XMLHttpRequest();
    xhr.open('GET', url, true);
    xhr.send();
    display.onload = false;
    xhr.onload = function() {
        let res = JSON.parse(xhr.responseText); 
        document.querySelector('.table').innerHTML = '';
        console.log(res);
        if (res.length >= 1) {
            for (row of res) {
                let html = document.createElement('tr');
                let img = new Image;
                img.src = '' + row.photo;
                html.innerHTML = `
                <td><img src="${img.src}"></td>
                <td>${row.name}</td>
                <td>${row.reg_num}</td>
                <td>${row.review}</td>
                <td>${row.status}</td>
                `;
                html.dataset.id = row.id;
                document.querySelector('.table').appendChild(html);
            }
            changeTableHedaers(2);
        } 
    }
}

function changeTableHedaers(type) {
    let headers = [
        'Фото', 'Ф.И.О. Адвоката', 'Регистрационный номер', 'Отзывы', 'Статус'
    ];
    let deafultHeader = [
        'Ф.И.О. Адвоката', 'Регистрационный номер', 'Номер удостоверения', 'Адрес', 'Телефон'
    ];
    if (type == 1) {
        let th = document.querySelectorAll('thead td');        
        for (let i = 0; i< th.length; i++) {
            th[i].innerText = deafultHeader[i];
        }
    } else if (type == 2) {
        let th = document.querySelectorAll('thead td');
        console.log(th);
        for (let i = 0; i< th.length; i++) {
            th[i].innerText = headers[i];
        }
    }
}

function sendFeedback() {
    try {
        if (display.feedback) {
            let parent = document.querySelector('.feedback').querySelector('.left');
            parent.children[5].innerHTML = '<i class="fa fa-spin fa-circle-o-notch"></i>';
            let data = {
                name: parent.children[1].value,
                num: parent.children[2].value,
                ask: parent.children[3].value 
            };
            if (data.name && data.num && data.ask) {
                let xhr = new XMLHttpRequest();
                xhr.open('POST', '/assets/php/feedback.php', true);
                xhr.setRequestHeader('Content-Type', 'application/x-www-form-urlencoded')
                xhr.send(`name=${data.name}&tel=${data.num}&ask=${data.ask}`);
                xhr.onload = function() {
                    if (xhr.responseText == 'OK') {
                        display.feedback = false;
                        parent.children[1].value = '';
                        parent.children[2].value = '';
                        parent.children[3].value = '';
                        parent.children[5].innerHTML = '<i class="fa fa-check" aria-hidden="true"></i> Отправлено';
                    } else {
                        document.querySelector('.feedback .btn').innerHTML = '<i class="fa fa-close" aria-hidden="true"></i> Не отправлено';
                        throw `Error on php, ${xhr.responseText}`;
                    }
                }
                xhr.onerror = function() {
                    throw 'Error on ajax';
                }
            } else {
                throw 'Error on client';
            }
        } else throw 'Error dupl'; 
    } catch (err) {
        console.log(err);
        document.querySelector('.feedback .btn').innerHTML = '<i class="fa fa-close" aria-hidden="true"></i> Не отправлено';
    }
}


</script>